faweiz/FACEBOOKapo/nRF5_SDK_12.1/examples/ble_peripheral/3DPS_UART_SPI0_ADS/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

//****************** Modified on 1/15/2017 （+SPI) ******************//	
/**
 * @brief SPI user event handler.
 * @param event
 */
void spi_event_handler(nrf_drv_spi_evt_t const * p_event)
{
    spi_xfer_done = true;
    NRF_LOG_INFO("Transfer completed.\r\n");
    if (m_rx_buf[0] != 0)
    {
        NRF_LOG_INFO(" Received: \r\n");
        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
    }
}
void SPI_init(){
	LEDS_CONFIGURE(BSP_LED_0_MASK);
    LEDS_OFF(BSP_LED_0_MASK);

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    NRF_LOG_INFO("SPI example\r\n");

    nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config.ss_pin   = SPI_SS_PIN;
    spi_config.miso_pin = SPI_MISO_PIN;
    spi_config.mosi_pin = SPI_MOSI_PIN;
    spi_config.sck_pin  = SPI_SCK_PIN;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler));
}

void SPI_Function(uint8_t tx_buf[]){
	// Reset rx buffer and transfer done flag
        memset(m_rx_buf, 0, m_length);
        spi_xfer_done = false;

				APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, tx_buf, m_length, m_rx_buf, m_length));

        while (!spi_xfer_done)
        {
            __WFE();
        }

        NRF_LOG_FLUSH();

        LEDS_INVERT(BSP_LED_0_MASK);
        nrf_delay_ms(50);
}

void BLE_UART()
{
		// changed on 12/19/2016 10:51pm
			uint16_t length;
			uint8_t PrintBuffer[3]; 
//			uint16_t spi_rx = (m_rx_buf[0]<<8) | m_rx_buf[1];
	
			uint16_t spi_rx = ((m_rx_buf[0]&0x0F)<<8) | m_rx_buf[1];
	
			int ADC_value = spi_rx;
			double voltage_value = ADC_value / (4095/2.5);
//clear PrintBuffer buffer	
			memset(PrintBuffer,0x00,sizeof(PrintBuffer));
			sprintf((char*) PrintBuffer, "%.3f", voltage_value);
//get data length
			length = strlen((char*)PrintBuffer);
			
// Sent data over BLE		
				ble_nus_string_send(&m_nus, PrintBuffer, length);
// Print data over Serial Port	
				printf("\n ADC Value = %d \n",ADC_value);
				printf(" Voltage = %.3f \n",voltage_value);
	printf(" spi_rx = %x \n",spi_rx);
	printf(" m_rx_buf[0] = %d \n",m_rx_buf[0]);
	printf(" m_rx_buf[1] = %d \n",m_rx_buf[1]);
	nrf_delay_ms(200);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
	
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		
    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

		SPI_init();
	
//	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, m_length, m_rx_buf, m_length));
			
    // Enter main loop.
		while(1)
    {
		//****************** Modified on 12/20/2016 （UART + SPI_ADC) ******************//
			SPI_Function(m_tx_buf);
			BLE_UART();
			nrf_delay_ms(200);
			power_manage();
    }
}


	